docs/notes/idempotent.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Idempotency</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Idempotency</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga674991">Example</a>
<ul>
<li><a href="#orgd709eb4">Side effects</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
Means a function can be composed with itself and form the same result.
</p>

<p>
It doesn't necessarily mean you can do the same thing multiple times without
changing a result.
</p>

<p>
Is this the technical definition?
</p>

<div class="org-src-container">
<pre class="src src-clojure">(= (comp f f) f)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure">(inc 1)
(inc 1) ;; same result!
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure">(inc (inc 1))
</pre>
</div>

<p>
So <code>inc</code> is not idempotent.
</p>

<div id="outline-container-orga674991" class="outline-2">
<h2 id="orga674991"><a href="#orga674991">Example</a></h2>
<div class="outline-text-2" id="text-orga674991">
</div>
<div id="outline-container-orgd709eb4" class="outline-3">
<h3 id="orgd709eb4"><a href="#orgd709eb4">Side effects</a></h3>
<div class="outline-text-3" id="text-orgd709eb4">
<p>
Elevator buttons are idempotent. You can keep pushing button 5, and the
elevator won't change anything. It will still go to floor 5.
</p>

<p>
PUT vs POST. If I POST the same thing twice, will there be two of them, or
one of them? The HTTP spec encourages PUT to be idempotent and POST not to
be. So, if I PUT two of the same thing, there should only be 1 saved. If I
POST 2 of of the same thing, there will be 2 of them.
</p>
</div>
</div>
</div>
</div>
</body>
</html>